package common.commands;

import common.*;

import java.net.SocketAddress;

import static sql.Connector.saving;

/**
 * Команда "ВЫХОДА НЕТ"
 */
public class Exit {
    /**
     * Метод для прекращения работы программы
     */
    public void execute(String s) {
        if (s != null) {
            saving();
            System.out.println("\nСервер завершает свою работу.А пока посмотрите на художницу.");
            System.out.println("                   _\n" +
                    "                  H|| \n" +
                    "        __________H||___________\n" +
                    "       [|.......................|\n" +
                    "       ||.........## --.#.......|                       \n" +
                    "       ||.........   #  # ......|            @@@@\n" +
                    "       ||.........     *  ......|          @@@@@@@      \n" +
                    "       ||........     -^........|   ,      - @@@@        \n" +
                    "       ||.....##\\        .......|   |     '_ @@@        \n" +
                    "       ||....#####     /###.....|   |     __\\@ \\@       \n" +
                    "       ||....########\\ \\((#.....|  _\\\\  (/ ) @\\_/)____  \n" +
                    "       ||..####,   ))/ ##.......|   |(__/ /     /|% #/ \n" +
                    "       ||..#####      '####.....|    \\___/ ----/_|-*/   \n" +
                    "       ||..#####\\____/#####.....|       ,:   '(          \n" +
                    "       ||...######..######......|       |:     \\        \n" +
                    "       ||.....\"\"\"\"  \"\"\"\"...b'ger|       |:      )      \n" +
                    "       [|_______________________|       |:      |       \n" +
                    "              H||_______H||             |_____,_|       \n" +
                    "              H||________\\|              |   / (        \n" +
                    "              H||       H||              |  /\\  )        \n" +
                    "              H||       H||              (  \\| /        \n" +
                    "             _H||_______H||__            |  /'=.        \n" +
                    "           H|________________|           '=>/  \\        \n" +
                    "                                        /  \\ /|/\n" +
                    "                                      ,___/|   ");
            System.exit(0);
        }
       // System.out.println("Клиент нас покинул. Продолжу сидеть в одиночестве...");
    }

    public String getInfo() {
        return "exit : завершить программу ";
    }
}